#!/usr/bin/perl

sub ct
{

	my @line;

	open(f1,@_[0]); #打开一个f1, 输入args 1
	open(f2,">".@_[1]);
	@line=<f1>;

	foreach $i (@line)
	{
		$j=$i;#这个程序是用来更正字幕和嘴型对应的, 之前是不对应的. 
		while($i=~/(([0-9][0-9]):([0-9][0-9]):([0-9][0-9]))/)
		{
			$i=$';# 这样写不是很方便, 都折算成秒,那就很方便.
			if($4>33)
			{#大于33秒的话, -24 
				$k=$2.":".$3.":".($4-24);
			}
			elsif($4>23)
			{
				$k=$2.":".$3.":0".($4-24);
			}
			elsif($3>10)
			{
				$k=$2.":".($3-1).":".($4+36);
			}
			elsif($3>0)
			{
				$k=$2.":0".($3-1).":".($4+36);
			}
			elsif($2>10)
			{
				$k=($2-1).":59:".($4+36);
			}
			elsif($2>0)
			{
				$k="0".($2-1).":59:".($4+36);
			}
			else
			{
				$k=$1;
			}
	
			$j=~s/$1/$k/;
	
		}
			print f2 $j;
	}
		close(f2);
		close(f1);
}
	
	
&ct("Triumph-Nerds-001.srt","1.srt");
	
